In [2]:
%matplotlib inline
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
plt.rcParams["figure.figsize"] = [10,8]  # Set default figure size
import requests

d = pd.Series(np.random.randn(4), name = 'daily returns')
mul = d * 100
print(mul)
print(d.abs())
d.describe()

0     30.497882
1   -168.424475
2    -44.249865
3    -34.846423
Name: daily returns, dtype: float64
0    0.304979
1    1.684245
2    0.442499
3    0.348464
Name: daily returns, dtype: float64

count    4.000000
mean    -0.542557
std      0.830552
min     -1.684245
25%     -0.752935
50%     -0.395481
75%     -0.185103
max      0.304979
Name: daily returns, dtype: float64

In [15]:
d.index = ['google', 'facebook', 'twitter', 'amazon']
print(d)
print(d['amazon'])
d['google'] = 0
print(d)
'facebook' in d

google      0.000000
facebook    0.414933
twitter     2.202726
amazon     -0.624857
Name: daily returns, dtype: float64
-0.6248568554183005
google      0.000000
facebook    0.414933
twitter     2.202726
amazon     -0.624857
Name: daily returns, dtype: float64

True

In [6]:
df = pd.read_csv('https://raw.githubusercontent.com/QuantEcon/lecture-python-programming/master/source/_static/lecture_specific/pandas/data/test_pwt.csv')
type(df)

pandas.core.frame.DataFrame

In [22]:
df

,country,country isocode,year,POP,XRAT,tcgdp,cc,cg
A,Argentina,ARG,2000,37335.653,0.999500,2.950722e+05,75.716805,5.578804
B,Australia,AUS,2000,19053.186,1.724830,5.418047e+05,67.759026,6.720098
C,India,IND,2000,1006300.297,44.941600,1.728144e+06,64.575551,14.072206
D,Israel,ISR,2000,6114.570,4.077330,1.292539e+05,64.436451,10.266688
E,Malawi,MWI,2000,11801.505,59.543808,5.026222e+03,74.707624,11.658954
F,South Africa,ZAF,2000,45064.098,6.939830,2.272424e+05,72.718710,5.726546
G,United States,USA,2000,282171.957,1.000000,9.898700e+06,72.347054,6.032454
H,Uruguay,URY,2000,3219.793,12.099592,2.525596e+04,78.978740,5.108068

In [23]:
#select a row we used python indices
df[2:6]

,country,country isocode,year,POP,XRAT,tcgdp,cc,cg
C,India,IND,2000,1006300.297,44.941600,1.728144e+06,64.575551,14.072206
D,Israel,ISR,2000,6114.570,4.077330,1.292539e+05,64.436451,10.266688
E,Malawi,MWI,2000,11801.505,59.543808,5.026222e+03,74.707624,11.658954
F,South Africa,ZAF,2000,45064.098,6.939830,2.272424e+05,72.718710,5.726546

In [24]:
#select a column by passing the column name as an array like ['country', 'cc']
df[['country', 'cc']]

         country         cc
A      Argentina  75.716805
B      Australia  67.759026
C          India  64.575551
D         Israel  64.436451
E         Malawi  74.707624
F   South Africa  72.718710
G  United States  72.347054
H        Uruguay  78.978740

In [26]:
# To select both row and column we use iloc
df.iloc[0:3, 3:]

           POP      XRAT         tcgdp         cc         cg
A    37335.653   0.99950  2.950722e+05  75.716805   5.578804
B    19053.186   1.72483  5.418047e+05  67.759026   6.720098
C  1006300.297  44.94160  1.728144e+06  64.575551  14.072206

In [27]:
#To select rows and columns using a mixture of integers and labels, the loc attribute can be used in a
df.loc[df.index[2:5], ['country', 'tcgdp']]

  country         tcgdp
C   India  1.728144e+06
D  Israel  1.292539e+05
E  Malawi  5.026222e+03

In [28]:
df[df.POP >= 20000]

,country,country isocode,year,POP,XRAT,tcgdp,cc,cg
A,Argentina,ARG,2000,37335.653,0.99950,2.950722e+05,75.716805,5.578804
C,India,IND,2000,1006300.297,44.94160,1.728144e+06,64.575551,14.072206
F,South Africa,ZAF,2000,45064.098,6.93983,2.272424e+05,72.718710,5.726546
G,United States,USA,2000,282171.957,1.00000,9.898700e+06,72.347054,6.032454

In [29]:
df.query("country in ['Argentina', 'India', 'South Africa'] and POP > 40000")

,country,country isocode,year,POP,XRAT,tcgdp,cc,cg
C,India,IND,2000,1006300.297,44.94160,1.728144e+06,64.575551,14.072206
F,South Africa,ZAF,2000,45064.098,6.93983,2.272424e+05,72.718710,5.726546

In [33]:
df[df.cc == max(df.cc)]
df[df.POP == min(df.POP)]

,country,country isocode,year,POP,XRAT,tcgdp,cc,cg
H,Uruguay,URY,2000,3219.793,12.099592,25255.961693,78.97874,5.108068

In [40]:
df.loc[(df.cc + df.cg < 100) & (df.year == 2000) ,['country isocode', 'year','POP','XRAT']]

  country isocode  year          POP       XRAT
A             ARG  2000    37335.653   0.999500
B             AUS  2000    19053.186   1.724830
C             IND  2000  1006300.297  44.941600
D             ISR  2000     6114.570   4.077330
E             MWI  2000    11801.505  59.543808
F             ZAF  2000    45064.098   6.939830
G             USA  2000   282171.957   1.000000
H             URY  2000     3219.793  12.099592

In [43]:
df.loc[df.index[:2], ['country', 'year', 'POP']]

     country  year        POP
A  Argentina  2000  37335.653
B  Australia  2000  19053.186

In [44]:
df_subset = df[['country', 'POP', 'tcgdp']]
df_subset

         country          POP         tcgdp
A      Argentina    37335.653  2.950722e+05
B      Australia    19053.186  5.418047e+05
C          India  1006300.297  1.728144e+06
D         Israel     6114.570  1.292539e+05
E         Malawi    11801.505  5.026222e+03
F   South Africa    45064.098  2.272424e+05
G  United States   282171.957  9.898700e+06
H        Uruguay     3219.793  2.525596e+04

In [45]:
df_subset.to_csv('pwt_df.csv', index = False)

In [46]:
df[['year', 'POP', 'XRAT', 'tcgdp', 'cc', 'cg']].apply(max)

year     2.000000e+03
POP      1.006300e+06
XRAT     5.954381e+01
tcgdp    9.898700e+06
cc       7.897874e+01
cg       1.407221e+01
dtype: float64

In [47]:
df.apply(lambda row: row, axis=1)

,country,country isocode,year,POP,XRAT,tcgdp,cc,cg
A,Argentina,ARG,2000,37335.653,0.999500,2.950722e+05,75.716805,5.578804
B,Australia,AUS,2000,19053.186,1.724830,5.418047e+05,67.759026,6.720098
C,India,IND,2000,1006300.297,44.941600,1.728144e+06,64.575551,14.072206
D,Israel,ISR,2000,6114.570,4.077330,1.292539e+05,64.436451,10.266688
E,Malawi,MWI,2000,11801.505,59.543808,5.026222e+03,74.707624,11.658954
F,South Africa,ZAF,2000,45064.098,6.939830,2.272424e+05,72.718710,5.726546
G,United States,USA,2000,282171.957,1.000000,9.898700e+06,72.347054,6.032454
H,Uruguay,URY,2000,3219.793,12.099592,2.525596e+04,78.978740,5.108068

In [48]:
complexCondition = df.apply(
    lambda row: row.POP > 40000 if row.country in ['Argentina', 'India', 'South Africa'] else row.POP < 20000,
    axis=1), ['country', 'year', 'POP', 'XRAT', 'tcgdp']
df.loc[complexCondition]

        country  year          POP       XRAT         tcgdp
B     Australia  2000    19053.186   1.724830  5.418047e+05
C         India  2000  1006300.297  44.941600  1.728144e+06
D        Israel  2000     6114.570   4.077330  1.292539e+05
E        Malawi  2000    11801.505  59.543808  5.026222e+03
F  South Africa  2000    45064.098   6.939830  2.272424e+05
H       Uruguay  2000     3219.793  12.099592  2.525596e+04

In [7]:
df.query("POP >= 2000")

,country,country isocode,year,POP,XRAT,tcgdp,cc,cg
0,Argentina,ARG,2000,37335.653,0.999500,2.950722e+05,75.716805,5.578804
1,Australia,AUS,2000,19053.186,1.724830,5.418047e+05,67.759026,6.720098
2,India,IND,2000,1006300.297,44.941600,1.728144e+06,64.575551,14.072206
3,Israel,ISR,2000,6114.570,4.077330,1.292539e+05,64.436451,10.266688
4,Malawi,MWI,2000,11801.505,59.543808,5.026222e+03,74.707624,11.658954
5,South Africa,ZAF,2000,45064.098,6.939830,2.272424e+05,72.718710,5.726546
6,United States,USA,2000,282171.957,1.000000,9.898700e+06,72.347054,6.032454
7,Uruguay,URY,2000,3219.793,12.099592,2.525596e+04,78.978740,5.108068

In [ ]:
df.query("country in ['Argentina', 'Australia', 'india', 'Israel']")